app/views/devise/registrations/new.html.erb

SELECT "professions".* FROM "professions"
---
    <%= f.label :profession_id %><br />
    <%= f.collection_select(:profession_id, Profession.all, :id, :role, :include_blank => true) %>