one_day_experience/app/controllers/application_controller.rb

SELECT "professionals".* FROM "professionals"
---
  def index
  	@professional = Professional.all