app/controllers/application_controller.rb

SELECT "professionals".* FROM "professionals"
---
  def index
  	@professionals = Professional.all